unload/cf/DataProcessors/ВСД_ЛабИсследования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>ВСД_ЛабИсследования</Name>
			<Comment>Групповое оформление Лабораторных исследований для произведенных партий</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыбШаблон</Name>
					<Comment>Шаблон ЛабИсселедований</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВСД2_ЛабораторныеИсследования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВФоне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Партии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсдДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаписи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛабИсследования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_ЛабораторныеИсследования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗапроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

unload/cf/Documents/ВСД2_ЛабораторныеИсследования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ВСД2_ЛабораторныеИсследования</Name>
			<Comment>api 2.0</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исследования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерАктаОтбораПроб</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтбораПроб</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЛаборатории</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоказателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРезультата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодИсследования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЭкспертизы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатИсследования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_РезультатИсследования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заключение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>удалить_Запросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

unload/cf/DataProcessors/ВСД_ЛабИсследования/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания Экспорт;

&НаКлиенте
Перем АдресПараметров Экспорт;

&НаСервере
Функция ПолучитьСообщенияНаСервере( ) 
    
	//Сообщения=ПолучитьСообщенияПользователю(Истина);
	Попытка		
		Сообщения = ДлительныеОперации.СообщенияПользователю( Истина, ИдентификаторЗадания );
	Исключение
		//если в ОбщемМодуле нет функции 
		//например в Бухгалтерии 2.0
		Сообщения = ВСД_Общий.СообщенияПользователю( Истина, ИдентификаторЗадания );
	КонецПопытки;
	
 	Возврат Сообщения;
    
КонецФункции

&НаКлиенте
Процедура ЗакрытьФормуДлительнойОперации()
	
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации( ФормаДлительнойОперации );
	
	//Если ТипЗнч(ФормаДлительнойОперации) = Тип("УправляемаяФорма") Тогда
	//	Если ФормаДлительнойОперации.Открыта() Тогда
	//		ФормаДлительнойОперации.Закрыть();
	//	КонецЕсли;
	//КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ЗаданиеВыполнено() 
	Возврат ДлительныеОперации.ЗаданиеВыполнено( ИдентификаторЗадания );
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	МассивСообщений = ПолучитьСообщенияНаСервере( );
	//МассивСообщений = ПолучитьСообщенияПользователю(Истина);
	Для Каждого Сообщение Из МассивСообщений Цикл
		Сообщение.Сообщить();
		Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
		Сообщение.Сообщить();
	КонецЦикла;
	
	Попытка
		Если ЗаданиеВыполнено() Тогда 
			//ЗагрузитьПодготовленныеДанные();
			ЗагрузитьПараметры( );
			
			ЗакрытьФормуДлительнойОперации();
			Возврат;
		КонецЕсли;		
	Исключение
		ЗакрытьФормуДлительнойОперации();
		ВызватьИсключение;
	КонецПопытки;
 
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
КонецПроцедуры

&НаСервере
// как результат выполнения функции в фоне
Процедура ЗагрузитьПараметры( )
	ФОбъект = РеквизитФормыВЗначение("Объект");
	
	попытка
		Результат = ПолучитьИзВременногоХранилища( АдресХранилища );
		
		Если ЗначениеЗаполнено( Результат["Параметры"] ) Тогда 	
			ВСД.ЗагрузитьПараметрыВОбработку( ФОбъект , Результат["Параметры"] );
		КонецЕсли;
	Исключение КонецПопытки;
	
	//ФОбъект.ЗагрузитьПараметры(ФОбъект.Организация);
	//ФОбъект.ЗаполнитьТабличныеЧасти(флПеремещения);
	ЗначениеВРеквизитФормы(ФОбъект, "Объект");			
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныеЧасти()
	
    Запрос = Новый Запрос;	
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

    Запрос.Текст =
    "ВЫБРАТЬ
    |	ВСД_Партия.Ссылка КАК Партия,
    |	ВСД_Партия.ВсдДата КАК ВсдДата,
    |	ВСД_Партия.ДатаИзготовления1 КАК ДатаИзготовления1,
    |	ВСД_Партия.Продукция_Элемент КАК Продукция,
    |	ВСД_Партия.НомерЗаписи КАК НомерЗаписи,
    |	ВСД_Партия.Статус КАК СтатусПартии,
    |	ВСД_Партия.Количество КАК Количество,
    |	ВСД2_ЛабораторныеИсследования.Ссылка КАК ЛабИсследования,
    |	ВСД2_ЛабораторныеИсследования.Статус КАК СтатусЗапроса
    |ИЗ
    |	Справочник.ВСД_Партия КАК ВСД_Партия
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВСД2_ЛабораторныеИсследования КАК ВСД2_ЛабораторныеИсследования
    |		ПО (ВСД2_ЛабораторныеИсследования.Партия = ВСД_Партия.Ссылка)
	|		И (ВСД2_ЛабораторныеИсследования.ПометкаУдаления = ЛОЖЬ)
    |ГДЕ
    |	ВСД_Партия.ПометкаУдаления = ЛОЖЬ
    |	";

	Если ЗначениеЗаполнено( Объект.ДатаСоздания	) Тогда 
		Запрос.Текст = Запрос.Текст + "
		| И ВСД_Партия.ВсдДата = &ДатаСоздания";
		Запрос.УстановитьПараметр("ДатаСоздания", Объект.ДатаСоздания );
	КонецЕсли;
	Если ЗначениеЗаполнено( Объект.ВыбПродукция	) Тогда 
		Запрос.Текст = Запрос.Текст + "
		| И ВСД_Партия.Продукция_Элемент = &Продукция_Элемент";
		Запрос.УстановитьПараметр("Продукция_Элемент", Объект.ВыбПродукция );
	КонецЕсли;
	
    Попытка
        РезультатЗапроса = Запрос.Выполнить();
		
		Объект.Партии.Загрузить( РезультатЗапроса.Выгрузить());
    Исключение
        РезультатЗапроса = Неопределено;
        ВСД.СообщитьИнфо("Указан неверный параметр "+Описаниеошибки());
    КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьТабличныеЧасти();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Объект.ДатаНачалаОтбора = НачалоДня(ТекущаяДата());
	//Объект.ДатаОкончанияОтбора = КонецДня(ТекущаяДата());
	//
	Объект.Организация = ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	//СписокКонстант = ВСД.ЗагрузитьПараметры( Объект.Организация );
	//ВСД.ЗагрузитьПараметрыВОбработку( Объект, СписокКонстант ); 
	
	ЗаполнитьТабличныеЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура СоздатьЛИНаСервере()
	
	Партии = Объект.Партии.Выгрузить();
	Для Каждого стрПартия из Партии Цикл
		Если стрПартия.Пометка Тогда 
			
			Сообщить(стрПартия.Партия);
			Док = Документы.ВСД2_ЛабораторныеИсследования.СоздатьДокумент();
			Док.Дата = ТекущаяДата();
			
			Док.Исследования.Загрузить( Объект.ВыбШаблон.Исследования.Выгрузить() );
			Док.Партия = стрПартия.Партия;
			Док.Организация = Объект.ВыбШаблон.Организация;
			Док.Записать();
			стрПартия.ЛабИсследования = Док.Ссылка;
			
		КонецЕсли;
			
	КонецЦикла;
	
	ЗаполнитьТабличныеЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛИ(Команда)
	СоздатьЛИНаСервере();
КонецПроцедуры

&НаСервере
Функция ПодготовитьСписокВСДКОтправке() Экспорт
	
	сзДокументыКОтправке = новый Массив;
	Для каждого СтрПартии Из Объект.Партии Цикл
		
		Если НЕ(ЗначениеЗаполнено(СтрПартии.ЛабИсследования)) или НЕ( СтрПартии.Пометка) Тогда 		
			Продолжить;    
		КонецЕсли;
		
		Если ( СтрПартии.СтатусЗапроса = "COMPLETED") или ( СтрПартии.ЛабИсследования.ПометкаУдаления ) Тогда
			//ВСД.СообщитьИнфоСервер("Документ ["+_ВСД+"] статус=["+_ВСД.Статус+"] уже был обработан");
			продолжить;
		КонецЕсли;
		
		//Если ЗначениеЗаполнено( СтрПартии.ЛабИсследования.applicationID) и НЕ ОтправлятьРанееОтправленные Тогда 
		//	Продолжить;
		//КонецЕсли;
		
		сзДокументыКОтправке.Добавить( СтрПартии.ЛабИсследования );
		//ВСД.СообщитьИнфоСервер(""+_ВСД+" Добавлен в очередь на отправку");
	КонецЦикла;
	Возврат сзДокументыКОтправке;
КонецФункции

&НаСервере
Функция ОтправитьВСД_НаСервере( )
	
	сзДокументыКОтправке = ПодготовитьСписокВСДКОтправке( );	

	//ПараметрыОрганизации = ВСД.ЗагрузитьПараметры( Объект.Организация );									
	//ПараметрыФункции = ВСД_Общий.ПараметрыСервер( ПараметрыОрганизации );
	ПараметрыФункции = ВСД.ЗагрузитьПараметры( Объект.Организация );
	ПараметрыФункции.Вставить("СписокДокументов", сзДокументыКОтправке);
	
	Если Объект.ОтправлятьВФоне Тогда 
		ИдентификаторЗадания = Неопределено;		
		НаименованиеЗадания = НСтр("ru = 'Ветис отправка ВСД'");
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне( УникальныйИдентификатор, 
			"ВСД_Запросы.ОтправитьВСДвГИС",
			ПараметрыФункции,
			НаименованиеЗадания);
		
		//результат обработки
		АдресХранилища       = Результат.АдресХранилища;		
		//для получения сообщений
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	Иначе;
		Для Каждого ДокСсылка Из сзДокументыКОтправке Цикл
			//ПараметрыФункции = ВСД.ЗагрузитьПараметры( ДокСсылка.Организация );
			Ответ = ВСД_Запросы.ВСД2_ЛабораторныеИсследования_Отправить( ПараметрыФункции, ДокСсылка);
		КонецЦикла;
		Результат = Новый Структура;
		Результат.Вставить("ЗаданиеВыполнено", Истина);
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Отправить(Команда)	
	
	ПоказатьОповещениеПользователя("Выполняется отправка ВСД",,"Ожидайте...",БиблиотекаКартинок.Информация32);
	
	Результат = ОтправитьВСД_НаСервере( );
	
	Если Результат.ЗаданиеВыполнено Тогда
		// Задание отработало, результат получен
		ПоказатьОповещениеПользователя("Выполнено");
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
	КонецЕсли;			
	
	ЗаполнитьТабличныеЧасти();
КонецПроцедуры
